//
//  HomeworkText.swift
//  Lecture4Homework
//
//  Created by Egor Lass on 29.04.2021.
//

// Closures(замыкания) и блоки совместимы, поэтому блокам можно присваиваивать замыкания,
// а в методы, которые ожидают блок можно передать замыкание.
// Блоки как и замыкания захватывают переменные, но в отличии от замыканий, переменные при захвате в блоке изменяются, а не копируются
// Далее приведены примеры блоков из Objective-C, как вызываются, совместимы ли с замыканиями, какие бывают.
//
// Файлы:
// BlocksTest.h – файл заголовков
// BlocksTest.m – файл имплементации
// MainTestController.swift – файл для тестирования созданных блоков и методов
// Lecture4Homework-Bridging-Header – файл для связи obj-c и swift
// Все остальные файлы в папке Other Files
